const container = document.querySelector('.container')
const heroJson = `[{
    "id": 1,
    "name": "Бэтмен",
    "universe": "DC Comics",
    "alter ego": "Брюс Уэйн",
    "occupation": "борец с преступностью, филантроп, миллиардер",
    "friends": "Робин, Бэтгерл",
    "superpowers": "интеллект, обширные познания, знания боевых искусств, ловкость",
    "details": "по популярности человек-летучая мышь может сравниться только с Суперменом. Его образ кажется очень мистическим и мрачным: черный костюм с развевающимся плащом, устрашающий Бэтмобиль, штаб-квартира в сырой пещере. Его биография настолько же темна, как и образ. В детстве у него на глазах убили родителей, и юный Брюс поклялся всеми силами защищать родной Готэм от преступности.", 
    "rating": 0,
}, {
    "id": 2,
    "name": "Супермен",
    "universe": "DC Comics",
    "alter ego": "Кларк Кент",
    "occupation": "борец за справедливость",
    "friends": "собака Крипто",
    "superpowers": "непробиваемость, суперсила, полет, самоисцеление, суперзрение и суперслух, классный костюм",
    "details":"полная противоположность своему противнику Бэтмену. Если Брюс Уэйн был простым человеком и стал героем, то Супермен героем родился, но вынужден был изображать выходца из бедной канзасской семьи. Последний представитель планеты Криптон был отправлен на Землю прямо перед тем, как его родина была уничтожена.",
    "rating": 0,
}, {
    "id": 3,
    "name": "Железный человек",
    "universe": "Marvel Comics",
    "alter ego": "Тони Старк",
    "occupation": "гений, миллиардер, плейбой, филантроп",
    "friends": "Мстители",
    "superpowers": "высокий уровень интеллекта, широкие познания науки и техники, связь со всемирной паутиной, бронекостюмы",
    "details":"пожалуй, самый популярный современный супергерой. У него много общего с мрачной птицей ночи Бэтменом: оба потеряли родителей в детстве, стали борцами с преступностью без особых сверхсил, невероятно богатые. Только если Бэтменом восхищаются, то Тони Старка — обожают :) То ли дело в шикарной актерской игре Роберта Дауни мл., который выбил роль у Николаса Кейджа и Тома Круза, то ли в хорошо прописанном персонаже.",
    "rating": 0,
}, {
    "id": 4,
    "name": "Человек-паук",
    "universe": "Marvel Comics",
    "alter ego": "Питер Паркер",
    "occupation": "борец за справедливость, студент, фотограф",
    "friends": "Мстители, Фантастическая четверка, Люди Икс",
    "superpowers": "сверхчеловеческие рефлексы, «паучье чутье», способность прилепляться к твердым поверхностям, производство паутины",
    "details": "Человек-паук родился от потребности Marvel Comics создать героя-подростка. Другие супергерои вроде Бэтмена и Супермена — взрослые мужчины, и целевая аудитория не видела в них примеры для подражания. Пятнадцатилетний Питер Паркер дал понять всем тинейджерам Земли, что можно и злодеев уничтожить, и на красавице жениться. Для этого даже не обязательно быть суперкрасавчиком! Всего лишь нужен укус паучка:)",
    "rating": 0,
}, {
    "id": 5,
    "name": "Капитан Америка",
    "universe": "Marvel Comics",
    "alter ego": "Стивен Роджерс",
    "occupation": "супер-солдат",
    "friends": "Мстители",
    "superpowers": "сила, выносливость, бессмертие, быстрая регенерация, мастерство скрытности и боя",
    "details": "Капитан Америка — персонаж, целеноправленно созданный, чтобы воплощать идеалы патриотизма. Потому он был особенно популярный во время Второй мировой войны. В комиксах обращение «Капитан Америка» применяется к любому, кто выбран правительством США. Больше всего оно закрепилось именно за Стивом Роджерсом.",
    "rating": 0,
}, {
    "id": 6,
    "name": "Тор",
    "universe": "Marvel Comics",
    "alter ego": "нет; полное имя — Тор Одинсон",
    "occupation": "борец за справедливость, скандинавский бог",
    "friends": "Мстители",
    "superpowers": "все, что может бог, плюс молот Мьелнир",
    "details": "персонаж Тора основан на образе одноименного скандинавского бога. Тор во вселенной Marvel — родной сын Одина и древнейшей богини Геи. После рождения сына Один забрал его в Асгард, где растил вместе со своей женой, богиней Фригг. Последнюю Тор всегда считал своей настоящей матерью и лишь много позже узнал правду о своем рождении.",
    "rating": 0,
}, {
    "id": 7,
    "name": "Халк",
    "universe": "Marvel Comics",
    "alter ego": "Брюс Беннер",
    "occupation": "супергерой, борец за справедливость, ученый-биохимик",
    "friends": "Мстители",
    "superpowers": "сверхчеловеческая сила искорость, выносливость, полет",
    "details": "идею создания Халка как персонажа можно отнести к фантастической новелле «Странная история доктора Джекила и мистера Хайда», в которой ученый не может примириться со своим демоническим альтер эго. Прошлое у Халка — хуже некуда: отец Брюса страдал от алкоголизма и приступов ярости, а мать пыталась всеми силами уберечь сына от гнева своего мужа. Она погибла, защищая своего единственного ребенка от его побоев.",
    "rating": 0,
}, {
    "id": 8,
    "name": "Чудо-женщина",
    "universe": "DC Comics",
    "alter ego": "Диана Принс",
    "occupation": "супергероиня, секретарь-референт",
    "friends": "Лига Справедливости, Бэтмен, Супермен",
    "superpowers": "сверхчеловеческая сила и скорость, выносливость, полет"
    "details": "пора бы разбавить эту мужскую вечеринку по-настоящему крутой девчонкой :) Принцесса-амозонка родилась на мистическом острове Темескира, расположенном в центре Бермудского треугольника, где пропадают самолеты. Свое настоящее имя — Диана — она получила в честь древнегреческой богини охоты, а суперспособности — от богини любви Афродиты. Растили героиню в исключительно женском обществе, поэтому Чудо-женщина часто появляется в культуре как символ феминизма.",
    "rating": 0,
}, {
    "id": 9,
    "name": "Черная вдова",
    "universe": "Marvel Comics",
    "alter ego": "Наташа Романофф",
    "occupation": "супергероиня, шпионка",
    "friends": "Мстители",
    "superpowers": "пик человеческого физического потенциала, замедленное старение, знание многих языков",
    "details": "супергероиня российского происхождения родилась предположительно в 1928 году в Сталинграде. Во время Второй мировой войны она потеряла родителей и была спасена из горящего дома советским солдатом. Тот на некоторое время стал ее опекуном. Повзрослев, Наташа попала в организацию «Красная Комната», где прошла многочисленные тренировки, а именно — была частью шпионской программы.",
    "rating": 0,
}, {
    "id": 10,
    "name": "Дэдпул",
    "universe": "Marvel Comics",
    "alterego": "Уэйд Уинстон Уилсон",
    "occupation": "антигерой, наемник",
    "friends": "частично Мстители, Человек-паук, Росомаха",
    "superpowers": "высокий болевой порог, регенерация и бессмертие, сверхчеловеческая иммунная система",
    "details": "как и Росомаха из Людей Икс, Дэдпул был подвергнут опытам по программе «Оружие Икс». Ученые попытались исцелить его рак, привив его клеткам способность к регенерации. Как и всегда в комиксах, что-то пошло не так, и Дэдпул остался изуродованным и психически нестабильным.",
    "rating": 0,
}]`;

function getArrHeroesPage(jsonArr) {
    const arrHeroes = JSON.parse(jsonArr)
    createListHeroes(arrHeroes)
}

getArrHeroesPage(heroJson)

function createHeroesPage(obj) {
    const {
        id,
        name,
        universe,
        alterego,
        occupation,
        friends,
        superpowers,
        details,
        rating,
    } = obj
    const div = document.createElement('div')
    div
        .classList
        .add('card')
    const template = <h1>${name}</h1>;
    <p>${id}</p>;
    <p>Вселенная:${universe}</p>;
    <p>Альтер эго: ${alterego}</p>;
    <p>Род деятельности:${occupation}</p>;
    <p>Друзья: ${friends}</p>;
    <p>Суперсилы: ${superpowers}</p>;
    <p>Подробнее: ${details}</p>;
    <p>Поставить оценку: ${rating}</p>;
    <p>${template}</p>;

    <input type='number' id='${id}' value='${rating}'>
        <button class='btnSaveRating'>Поставить оценку></button>

        div.innerHTML = template container.append(div)
        
        function createListHeroes(arr){
            container.innerHTML = ''
            arr.forEach(item => {
                createHeroesPage(item)
            })
        }
        container.addEventListener('click', (event) => {
            if (event.target.classList.contains('btnSaveRating')) {
                saveRatingLocal(event.target)
            }})
            function saveRatingLocal(element){
            const parent = element.parentNode;
            const inputRating = parent.querySelector('input');
            const id = inputRating
                .id
            localStorage.setItem(id, rating);
        }